{
    "content": [
        {
            "id": 533535,
            "mimeType": "MP4",
            "category": "movie",
            "title": "Deadpool & Wolverine",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Ação, Comédia, Ficção científica",
            "poster": "https://image.tmdb.org/t/p/w500/cJFqqiDYprqExaXatu4AaoMzDG2.jpg",
            "description": "Um apático Wade Wilson trabalha duro na vida civil. Seus dias como mercenário moralmente flexível, Deadpool, ficaram para trás. Quando seu planeta enfrenta uma ameaça, Wade deve relutantemente vestir-se novamente com um ainda mais relutante... relutante? Mais relutante? Ele deve convencer um Wolverine relutante em... Porra. As sinopses são tão estúpidas."
        },
        {
            "id": 1241982,
            "mimeType": "MP4",
            "category": "movie",
            "title": "Moana 2",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Animação, Aventura, Família, Comédia",
            "poster": "https://image.tmdb.org/t/p/w500/3E9oViQjwbbrHJogG7NtfcKWRXw.jpg",
            "description": "Depois de receber um chamado inesperado de seus ancestrais navegadores, Moana vai viajar para mares distantes da Oceania, em águas perdidas em uma aventura perigosa."
        },
        {
            "id": 1184918,
            "mimeType": "MP4",
            "category": "movie",
            "title": "Robô Selvagem",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Animação, Ficção científica, Família",
            "poster": "https://image.tmdb.org/t/p/w500/cWsd33Nwp3tgYB5LMMadl3qVMKh.jpg",
            "description": "Um robô – unidade ROZZUM 7134, abreviadamente “Roz” – naufraga em uma ilha desabitada e deve aprender a se adaptar ao ambiente hostil, gradualmente construindo relacionamentos com os animais da ilha e se tornando o pai adotivo de um filhote de ganso órfão."
        },
        {
            "id": 1100782,
            "mimeType": "MP4",
            "category": "movie",
            "title": "Sorria 2",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Terror, Mistério",
            "poster": "https://image.tmdb.org/t/p/w500/ypHiYvSJmHIyRDRiosZuE595uir.jpg",
            "description": "A sequência vai girar em torno de Quinn Parsons (vivida por Naomi Scott, de Aladdin), uma cantora miserável em turnê que está tentando se recuperar do seu vício em drogas. Ela se tornará alvo da entidade do primeiro filme após seu traficante lhe passar a maldição."
        },
        {
            "id": 558449,
            "mimeType": "MP4",
            "category": "movie",
            "title": "Gladiador 2",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Ação, Aventura",
            "poster": "https://image.tmdb.org/t/p/w500/342bly9MqveL65TnEFzx8TTUxcL.jpg",
            "description": "Anos depois de testemunhar a trágica morte do reverenciado herói Maximus nas mãos de seu tio malvado, Lucius se vê forçado a lutar no Coliseu depois que sua terra natal é conquistada por dois imperadores tirânicos, que agora governam Roma. Com o coração ardendo de raiva e o destino do Império pendurado por um fio, Lucius deve enfrentar perigos e inimigos, redescobrindo em seu passado a força e a honra necessárias para trazer a glória de Roma de volta ao seu povo. Prepare-se para uma jornada épica de coragem e vingança na sangrenta arena do Coliseu."
        },
        {
            "id": 402431,
            "mimeType": "MP4",
            "category": "movie",
            "title": "Wicked",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Drama, Fantasia, Romance",
            "poster": "https://image.tmdb.org/t/p/w500/qcaKkLwIXCAxJtpetVYHniCvLZj.jpg",
            "description": "O longa conta a história de Elphaba (Cynthia Erivo), uma jovem incompreendida por causa de sua pele verde incomum, que ainda não descobriu seu verdadeiro poder, e de Glinda (Ariana Grande), uma jovem popular e ambiciosa que só quer saber de privilégios e ainda não conhece a sua verdadeira alma. As duas se conhecem na Universidade de Shiz, na Terra de OZ, e se tornam grandes amigas, mas suas diferenças fazem com que a vida as separe, levando-as a cumprirem seus destinos como a Bruxa Boa e a Bruxa Má do Oeste."
        },
        {
            "id": 533535,
            "mimeType": "MP4",
            "category": "movie",
            "title": "Deadpool & Wolverine",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Ação, Comédia, Ficção científica",
            "poster": "https://image.tmdb.org/t/p/w500/cJFqqiDYprqExaXatu4AaoMzDG2.jpg",
            "description": "Um apático Wade Wilson trabalha duro na vida civil. Seus dias como mercenário moralmente flexível, Deadpool, ficaram para trás. Quando seu planeta enfrenta uma ameaça, Wade deve relutantemente vestir-se novamente com um ainda mais relutante... relutante? Mais relutante? Ele deve convencer um Wolverine relutante em... Porra. As sinopses são tão estúpidas."
        },
        {
            "id": 238,
            "mimeType": "MP4",
            "category": "movie",
            "title": "O Poderoso Chefão",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Drama, Crime",
            "poster": "https://image.tmdb.org/t/p/w500/uP46DujkD3nwcisOjz9a0Xw0Knj.jpg",
            "description": "Em 1945, Don Corleone é o chefe de uma mafiosa família italiana de Nova York. Ele costuma apadrinhar várias pessoas, realizando importantes favores para elas, em troca de favores futuros. Com a chegada das drogas, as famílias começam uma disputa pelo promissor mercado. Quando Corleone se recusa a facilitar a entrada dos narcóticos na cidade, não oferecendo ajuda política e policial, sua família começa a sofrer atentados para que mudem de posição. É nessa complicada época que Michael, um herói de guerra nunca envolvido nos negócios da família, vê a necessidade de proteger o seu pai e tudo o que ele construiu ao longo dos anos."
        },
        {
            "id": 240,
            "mimeType": "MP4",
            "category": "movie",
            "title": "O Poderoso Chefão: Parte II",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Drama, Crime",
            "poster": "https://image.tmdb.org/t/p/w500/7g6wvsWHxBQujUcSXvZLhdFpDUy.jpg",
            "description": "Após a máfia matar sua família, o jovem Vito foge da sua cidade na Sicília e vai para a América. Vito luta para manter sua família. Ele mata Black Hand Fanucci, que exigia dos comerciantes uma parte dos seus ganhos. Com a morte de Fanucci, o poderio de Vito cresce, mas sua família é o que mais importa para ele. Agora baseado no Lago Tahoe, Michael planeja fazer incursões em Las Vegas e Havana instalando negócios ligados ao lazer, mas descobre que aliados como Hyman Roth estão tentando matá-lo."
        },
        {
            "id": 242,
            "mimeType": "MP4",
            "category": "movie",
            "title": "O Poderoso Chefão: Parte III",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Crime, Drama, Thriller",
            "poster": "https://image.tmdb.org/t/p/w500/sLvNxyDfM9cHS3jwG0rEa7eR4lh.jpg",
            "description": "Don Michael Corleone está envelhecendo e, com a ajuda do sobrinho Vicente Mancini, busca a legitimação dos interesses da família, em Nova York e na Itália, antes de sua morte. Mas seu protegido não está só interessado em parte do império da família. Ele também deseja a filha de Michael, Mary."
        },
        {
            "id": 45758,
            "mimeType": "MP4",
            "category": "movie",
            "title": "O Poderoso Chefão Por Acaso",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Ação, Comédia, Crime",
            "poster": "https://image.tmdb.org/t/p/w500/sHbSKVxRRHf18mtp9yinaYlAjK9.jpg",
            "description": ""
        },
        {
            "id": 1097870,
            "mimeType": "MP4",
            "category": "movie",
            "title": "Querido Papai Noel",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Comédia, Fantasia, Terror",
            "poster": "https://image.tmdb.org/t/p/w500/ynOGBV2k8dlRkm9gLWNmruDc8gv.jpg",
            "description": "O simpático aluno do 6º ano Liam escreve para o Papai Noel pedindo para ele provar que ele é real. Mas Liam é disléxico e acidentalmente envia sua carta para Satanás, que aparece na casa de Liam, animado para ter sua primeira carta de fanboy e querendo um pouco da alma de Liam."
        },
        {
            "id": 845781,
            "mimeType": "MP4",
            "category": "movie",
            "title": "Operação Natal",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Ação, Comédia, Fantasia",
            "poster": "https://image.tmdb.org/t/p/w500/vjwR2Wql9BIrwkKWyvDLSuFeDgE.jpg",
            "description": "Depois que o Papai Noel – codinome: Das Neves – é sequestrado, o Chefe de Segurança do Polo Norte deve se unir ao mais infame caçador de recompensas do mundo em uma missão global e cheia de ação para salvar o Natal."
        },
        {
            "id": 278,
            "mimeType": "MP4",
            "category": "movie",
            "title": "Um Sonho de Liberdade",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Drama, Crime",
            "poster": "https://image.tmdb.org/t/p/w500/xSnM4ahmz692msbMTBsfBWHvR3M.jpg",
            "description": "Em 1946, Andy Dufresne, um banqueiro jovem e bem sucedido, tem a sua vida radicalmente modificada ao ser condenado por um crime que nunca cometeu, o homicídio de sua esposa e do amante dela. Ele é mandado para uma prisão que é o pesadelo de qualquer detento, a Penitenciária Estadual de Shawshank, no Maine. Lá ele irá cumprir a pena perpétua. Andy logo será apresentado a Warden Norton, o corrupto e cruel agente penitenciário, que usa a Bíblia como arma de controle e ao Capitão Byron Hadley que trata os internos como animais. Andy faz amizade com Ellis Boyd Redding, um prisioneiro que cumpre pena há 20 anos e controla o mercado negro da instituição."
        },
        {
            "id": 424,
            "mimeType": "MP4",
            "category": "movie",
            "title": "A Lista de Schindler",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Drama, História, Guerra",
            "poster": "https://image.tmdb.org/t/p/w500/bGhhNzJYDsuLruNN5bJ2PvLcMiq.jpg",
            "description": "O alemão Oskar Schindler viu na mão de obra judia uma solução barata e viável para lucrar com negócios durante a guerra. Com sua forte influência dentro do partido nazista, foi fácil conseguir as autorizações e abrir uma fábrica. O que poderia parecer uma atitude de um homem não muito bondoso, transformou-se em um dos maiores casos de amor à vida da História, pois este alemão abdicou de toda sua fortuna para salvar a vida de mais de mil judeus em plena luta contra o extermínio alemão."
        },
        {
            "id": 497,
            "mimeType": "MP4",
            "category": "movie",
            "title": "À Espera de um Milagre",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Fantasia, Drama, Crime",
            "poster": "https://image.tmdb.org/t/p/w500/14hEqW67IiHlKpzKMLUXyktzZIV.jpg",
            "description": "Milagres acontecem em lugares inesperados, mesmo no bloco de celas para o corredor da morte na Penitenciária Cold Mountain. Lá, John Coffey, um gentil e gigante prisioneiro com poderes sobrenaturais, traz um senso de espírito e humanidade aos seus guardas e colegas de cela."
        },
        {
            "id": 155,
            "mimeType": "MP4",
            "category": "movie",
            "title": "Batman: O Cavaleiro das Trevas",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Drama, Ação, Crime, Thriller",
            "poster": "https://image.tmdb.org/t/p/w500/4lj1ikfsSmMZNyfdi8R8Tv5tsgb.jpg",
            "description": "Após dois anos desde o surgimento do Batman, os criminosos de Gotham City têm muito o que temer. Com a ajuda do tenente James Gordon e do promotor público Harvey Dent, Batman luta contra o crime organizado. Acuados com o combate, os chefes do crime aceitam a proposta feita pelo Coringa e o contratam para combater o Homem-Morcego."
        },
        {
            "id": 496243,
            "mimeType": "MP4",
            "category": "movie",
            "title": "Parasita",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Comédia, Thriller, Drama",
            "poster": "https://image.tmdb.org/t/p/w500/bik2BZjmVjeE6LOZqtuTjb4jJPQ.jpg",
            "description": "Toda a família de Ki-taek está desempregada, vivendo num porão sujo e apertado. Uma obra do acaso faz com que o filho adolescente da família comece a dar aulas de inglês à garota de uma família rica. Fascinados com a vida luxuosa destas pessoas, pai, mãe, filho e filha bolam um plano para se infiltrarem também na família burguesa, um a um. No entanto, os segredos e mentiras necessários à ascensão social custarão caro a todos."
        },
        {
            "id": 122,
            "mimeType": "MP4",
            "category": "movie",
            "title": "O Senhor dos Anéis: O Retorno do Rei",
            "url": "https://58a4464faef53.streamlock.net/impd/ngrp:impd_all/playlist.m3u8",
            "tag": "Aventura, Fantasia, Ação",
            "poster": "https://image.tmdb.org/t/p/w500/aXS3D94iIO9dheHrG0BhgUR4Wuy.jpg",
            "description": "O confronto final entre as forças do bem e do mal que lutam pelo controle do futuro da Terra Média se aproxima. Sauron planeja um grande ataque a Minas Tirith, capital de Gondor, o que faz com que Gandalf e Pippin partam para o local na intenção de ajudar a resistência. Um exército é reunido por Theoden em Rohan, em mais uma tentativa de deter as forças de Sauron. Enquanto isso, Frodo, Sam e Gollum seguem sua viagem rumo à Montanha da Perdição para destruir o anel."
        }
    ]
}